In [1]:
import pandas as pd
pd.__version__

'0.22.0'

In [6]:
data = pd.read_csv('Data.csv') 
data.head(3)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No

In [7]:
startups = pd.read_csv('50_Startups.csv') 
startups.head(3)

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39

In [8]:
Position_Salaries = pd.read_csv('Position_Salaries.csv') 
Position_Salaries.head(3)

            Position  Level  Salary
0   Business Analyst      1   45000
1  Junior Consultant      2   50000
2  Senior Consultant      3   60000

In [9]:
Salary_Data = pd.read_csv('Salary_Data.csv') 
Salary_Data.head(3)

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0

In [ ]:
#machine learning 
#basic type 2
# 1. Supervised
#      fix lavel values / categorical
#      or, continuous values
#      ans kmn hobe ta amra jani  
#      types:
#      => Regression (for continuous values output)
#      => Classification (for categorical values output)
# 2. Unsupervised
#      output jana nai
# 3. Re-inforcement